app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("name", "description", "created_uid", "updated_uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Observateur"], ["description", "Observateur"], ["created_uid", 1], ["updated_uid", 1], ["created_at", "2020-03-27 22:34:42.138355"], ["updated_at", "2020-03-27 22:34:42.138355"]]
---
  def create
    @profile = Profile.new(profile_params)
    if @profile.save

SELECT "profiles".* FROM "profiles" ORDER BY name ASC
---
  def list
    @profiles = Profile.all.order("name ASC")

UPDATE "profiles" SET "description" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["description", ""], ["updated_at", "2020-03-27 23:30:35.008633"], ["id", 1]]
---
  def update
    if @profile.blank?
      @message = {"status": "0", "message": "Ce profil n'existe pas"}
    else
      @profile.update_attributes(profile_params)

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def set_profile
    @profile = Profile.find_by_id(params[:id])