app/controllers/requests_controller.rb

  def create
    @request = Request.new(request_params)
    if @request.save
---
INSERT INTO "requests" ("user_id", "reference", "text", "status", "type_request", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"