app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("firstname", "lastname", "phone", "email", "password", "active", "profile_id", "terms", "is_admin", "created_uid", "updated_uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def list
    @users = User.all.order("created_at DESC")
---
SELECT "users".* FROM "users" ORDER BY created_at DESC

  def update
    if @user.blank?
      @message = {"status": "0", "message": "Cet utilisateur n'existe pas"}
    else
      @user.update_attributes(user_params)
---
UPDATE "users" SET "created_uid" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["created_uid", 6], ["updated_at", "2020-03-27 23:31:31.507019"], ["id", 3]]

  def disable
    if @user.blank?
      @message = {"status": "0", "message": "Cet utilisateur n'existe pas"}
    else
      @user.update_attributes(active: 0)
---
UPDATE "users" SET "active" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["active", 0], ["updated_at", "2020-03-28 12:27:13.259622"], ["id", 3]]

  def enable
    if @user.blank?
      @message = {"status": "0", "message": "Cet utilisateur n'existe pas"}
    else
      @user.update_attributes(active: 1)
---
UPDATE "users" SET "active" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["active", 1], ["updated_at", "2020-03-28 12:29:00.798996"], ["id", 3]]

  def login
    @user = User.where("(email = '#{params[:email]}' AND password = '#{params[:password]}') OR (phone = '#{params[:phone]}' AND password = '#{params[:password]}')")
---
SELECT "users".* FROM "users" WHERE ((email = 'dietricherwane@live.fr' AND password = 'duke') OR (phone = '02502080' AND password = 'duke'))

  def set_user
    @user = User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]